{
  "_name_or_path": "domlm",
  "architectures": [
    "DOMLMForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "depth_pad_id": 127,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_depth_embeddings": 128,
  "max_node_embeddings": 2048,
  "max_position_embeddings": 514,
  "max_sibling_embeddings": 128,
  "max_tag_embeddings": 128,
  "model_type": "domlm",
  "node_pad_id": 2047,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "sibling_pad_id": 127,
  "tag_pad_id": 127,
  "transformers_version": "4.25.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
